## How to deal with missing values in a Timeseries in Python

In [27]:
import pandas as pd
import numpy as np

In [28]:
ts_index = pd.date_range('01/01/2018',periods=8,freq='W')

In [29]:
ts_index

DatetimeIndex(['2018-01-07', '2018-01-14', '2018-01-21', '2018-01-28',
               '2018-02-04', '2018-02-11', '2018-02-18', '2018-02-25'],
              dtype='datetime64[ns]', freq='W-SUN')

In [30]:
df = pd.DataFrame(index=ts_index)

In [31]:
df['no_of_cars'] = [100,200,np.nan,np.nan,500,np.nan,np.nan,800]

In [32]:
df1=df.copy()
df2=df.copy()
df3=df.copy()
df4=df.copy()
df

            no_of_cars
2018-01-07       100.0
2018-01-14       200.0
2018-01-21         NaN
2018-01-28         NaN
2018-02-04       500.0
2018-02-11         NaN
2018-02-18         NaN
2018-02-25       800.0

In [33]:
## User Interpolate
df1.interpolate()

            no_of_cars
2018-01-07       100.0
2018-01-14       200.0
2018-01-21       300.0
2018-01-28       400.0
2018-02-04       500.0
2018-02-11       600.0
2018-02-18       700.0
2018-02-25       800.0

In [34]:
##Forward Fill

df2.ffill()

            no_of_cars
2018-01-07       100.0
2018-01-14       200.0
2018-01-21       200.0
2018-01-28       200.0
2018-02-04       500.0
2018-02-11       500.0
2018-02-18       500.0
2018-02-25       800.0

In [35]:
#Backward Fill

df3.bfill()

            no_of_cars
2018-01-07       100.0
2018-01-14       200.0
2018-01-21       500.0
2018-01-28       500.0
2018-02-04       500.0
2018-02-11       800.0
2018-02-18       800.0
2018-02-25       800.0